KINDLE_BOOK_RECOMMENDATIONS = [
    {"title": "The Sacketts Volume One 5-Book Bundle: Sackett's Land, To the Far Blue Mountains, The Warrior's Path, Jubal Sackett, Ride the River", "author": "Louis L'Amour"},
    {"title": "Methuselah's Children", "author": "Robert A. Heinlein"},
    {"title": "Build a Large Language Model (From Scratch)", "author": "Sebastian Raschka"},
    {"title": "Benjamin Franklin: An American Life", "author": "Walter Isaacson"},
    {"title": "Django for Professionals: Production websites with Python & Django", "author": "William S. Vincent"},
    {"title": "Django 5 Mastery: A Comprehensive Guide to Modern Web Development", "author": "Charles J. Diaz"},
    {"title": "Vibe Coding by Example", "author": "H. Peter Alesso"},
    {"title": "Django 5 Cookbook: 70+ problem solving techniques, sample programs, and troubleshoots across python programs and web apps", "author": "Clara Stein"},
    {"title": "Taking Manhattan: The Extraordinary Events That Created New York and Shaped America", "author": "Russell Shorto"},
    {"title": "Beginning Django API with React: Build Django 4 Web APIs with React Full Stack Applications", "author": "Greg Lim, Daniel Correa"},
    {"title": "Ethics 101: From Altruism and Utilitarianism to Bioethics and Political Ethics, an Exploration of the Concepts of Right and Wrong (Adams 101 Series)", "author": "Brian Boone"},
    {"title": "Django 5 for the Impatient: Learn the core concepts of Django to develop Python web applications", "author": "Daniel Correa, Greg Lim"},
    {"title": "Django 5 By Example: Build powerful and reliable Python web applications from scratch", "author": "Antonio Melé"},
    {"title": "Ethics For Dummies", "author": "Christopher Panza, Adam Potthast"},
    {"title": "Ethics: The Essential Writings (Modern Library Classics)", "author": "Gordon Marino, Gordon Marino"},
    {"title": "Accelerate DevOps with GitHub: Enhance software delivery performance with GitHub Issues, Projects, Actions, and Advanced Security", "author": "Michael Kaufmann"},
    {"title": "GitHub Actions Cookbook: A practical guide to automating repetitive tasks and streamlining your development process", "author": "Michael Kaufmann"},
    {"title": "Mastering GitHub Actions: Advance your automation skills with the latest techniques for software integration and deployment", "author": "Eric Chapman"},
    {"title": "JavaScript: The Comprehensive Guide to Learning Professional JavaScript Programming (Rheinwerk Computing)", "author": "Philip Ackermann"},
    {"title": "Before Machine Learning Volume 1 - Linear Algebra for A.I: The fundamental mathematics for Data Science and Artificial Inteligence.", "author": "Jorge Brasil"},
    {"title": "Ingathering: The Complete People Stories of Zenna Henderson", "author": "Zenna Henderson, Mark Olson, Priscilla Olson"},
    {"title": "Systems Thinking For Social Change: A Practical Guide to Solving Complex Problems, Avoiding Unintended Consequences, and Achieving Lasting Results", "author": "David Peter Stroh"},
    {"title": "The Spectrum of Self : Raymond Cattell's Theory of Personality", "author": "Freudian Trips"},
    {"title": "JavaScript Essentials For Dummies", "author": "Paul McFedries"}
]
