[
  {
    "title": "Building Your First ReACT LLM Agent Using Python: A Hands-On, Expert Guide to Mastering the Reasoning + Acting (ReACT) Pattern for Building Smart AI Agents ... OpenAI, LangChain, and Tool Integration",
    "author": "Adam McCleary"
  },
  {
    "title": "Generative AI with LangChain: Build production-ready LLM applications and advanced agents using Python, LangChain, and LangGraph",
    "author": "Ben Auffarth, Leonid Kuligin"
  },
  {
    "title": "Learning React: Modern Patterns for Developing React Apps",
    "author": "Alex Banks, Eve Porcello"
  },
  {
    "title": "Modern Full-Stack React Projects: Build, maintain, and deploy modern web apps using MongoDB, Express, React, and Node.js",
    "author": "Daniel Bugl"
  },
  {
    "title": "React Projects: Build 12 real-world applications from scratch using React, React Native, and React 360",
    "author": "Roy Derks"
  },
  {
    "title": "Docker Deep Dive: Zero to Docker in a single book",
    "author": "Nigel Poulton"
  },
  {
    "title": "The Kubernetes Book",
    "author": "Nigel Poulton"
  },
  {
    "title": "Django in Production: Expert tips, strategies, and essential frameworks for writing scalable and maintainable code in Django",
    "author": "Arghya Saha"
  },
  {
    "title": "A Developer's Essential Guide to Docker Compose: Simplify the development and orchestration of multi-container applications",
    "author": "Emmanouil Gkatziouras"
  },
  {
    "title": "The Sacketts Volume One 5-Book Bundle: Sackett's Land, To the Far Blue Mountains, The Warrior's Path, Jubal Sackett, Ride the River",
    "author": "Louis L'Amour"
  },
  {
    "title": "Methuselah's Children",
    "author": "Robert A. Heinlein"
  },
  {
    "title": "Build a Large Language Model (From Scratch)",
    "author": "Sebastian Raschka"
  },
  {
    "title": "Benjamin Franklin: An American Life",
    "author": "Walter Isaacson"
  },
  {
    "title": "Django for Professionals: Production websites with Python & Django",
    "author": "William S. Vincent"
  },
  {
    "title": "Django 5 Mastery: A Comprehensive Guide to Modern Web Development",
    "author": "Charles J.  Diaz"
  },
  {
    "title": "Vibe Coding by Example",
    "author": "H. Peter Alesso"
  },
  {
    "title": "Django 5 Cookbook: 70+ problem solving techniques, sample programs, and troubleshoots across python programs and web apps",
    "author": "Clara Stein"
  },
  {
    "title": "Taking Manhattan: The Extraordinary Events That Created New York and Shaped America",
    "author": "Russell Shorto"
  },
  {
    "title": "Beginning Django API with React: Build Django 4 Web APIs with React Full Stack Applications",
    "author": "Greg Lim, Daniel Correa"
  },
  {
    "title": "Ethics 101: From Altruism and Utilitarianism to Bioethics and Political Ethics, an Exploration of the Concepts of Right and Wrong (Adams 101 Series)",
    "author": "Brian Boone"
  },
  {
    "title": "Django 5 for the Impatient: Learn the core concepts of Django to develop Python web applications",
    "author": "Daniel Correa, Greg Lim"
  },
  {
    "title": "Django 5 By Example: Build powerful and reliable Python web applications from scratch",
    "author": "Antonio Melé"
  },
  {
    "title": "Ethics For Dummies",
    "author": "Christopher Panza, Adam Potthast"
  }
]